src/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура, обработчик события "БанкаПриИзменении".
//
&НаКлиенте
Процедура БИКБанкаПриИзменении(Элемент)
	
    ПолучитьБанкПоРеквизитам(Элемент, БИКБанка, Объект.Банк, БИКБанка, КоррСчетБанка);
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбора".
//
&НаКлиенте
Процедура БИКБанкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.Банки.ФормаВыбора", , Элемент);
	
КонецПроцедуры
 
&НаКлиенте
// Процедура получает банк по указанному БИК или корреспондентскому счету.
//
// Параметры:
//	Элемент - ПолеУправляемойФормы - Поле, в котором произведен выбор значения.
//	Значение - Строка - Значение, выбранное в поле.
//	Банк - СправочникСсылка.Банки - Значение поля для указания банка
//	БИК - Строка - БИК банка
//	КоррСчет - Строка - Корреспондентский счет банка
//
Процедура ПолучитьБанкПоРеквизитам(Элемент, Значение, Банк, БИК, КоррСчет)

	СписокБанков = ПолучитьБанкПоРеквизитамСервер(Элемент.Имя, Значение, Банк, БИК, КоррСчет);

	// Если возвращен список банков, произведем выбор банка из списка.
	Если СписокБанков.Количество() > 1 Тогда
	
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПолучитьБанкПоРеквизитамЗавершение", ЭтотОбъект), СписокБанков, Элемент);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБанкПоРеквизитамЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Банк = ВыбранныйЭлемент.Значение;
		ЗаполнитьБИКиКоррСчет(Объект.Банк, ЭтотОбъект.БИКБанка, ЭтотОбъект.КоррСчет);
	КонецЕсли;

КонецПроцедуры // ПолучитьБанкПоРеквизитам()
 
&НаСервере
// Процедура заполняет значения полей "БИК" и "КоррСчет".
//
Процедура ЗаполнитьБИКиКоррСчет(Банк, Бик, КоррСчет)

	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	Код КАК БИК,
	|	КоррСчет
	|ИЗ
	|	Справочник.Банки КАК Банки
	|ГДЕ
	|	Банки.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Банк);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Бик = Выборка.БИК;
		КоррСчет = Выборка.КоррСчет;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьБИКиКоррСчет()
 
&НаСервере
// Процедура получает банк по указанному БИК или корреспондентскому счету.
//
// Параметры:
//	Поле - Строка - Имя поля, в котором произведен выбор значения.
//	Значение - Строка - Значение, выбранное в поле.
//	Банк - СправочникСсылка.Банки - Значение поля для указания банка
//	БИК - Строка - БИК банка
//	КоррСчет - Строка - Корреспондентский счет банка
//
// Возвращаемое значение:
//	СписокЗначений - Список банков для интерактивного выбора.
//
Функция ПолучитьБанкПоРеквизитамСервер(Поле, Значение, Банк, БИК, КоррСчет)

	СписокБанков = Новый СписокЗначений;
	
	// Если значение не выбрано, очистим значение банка.
	Если ПустаяСтрока(Значение) Тогда
	
		Банк = Справочники.Банки.ПустаяСсылка();
		БИК = "";
		КоррСчет = "";
		
		Возврат СписокБанков;
		
	КонецЕсли;
	
	ТаблицаБанков = ПолучитьТаблицуБанковПоРеквизитам(Поле, Значение);
	Если ТаблицаБанков.Количество() = 0 Тогда
		СообщитьЧтоБанкНеНайден(Поле, Значение);
	ИначеЕсли ТаблицаБанков.Количество() = 1 Тогда
		ДанныеБанка = ТаблицаБанков[0];
		
		Банк = ДанныеБанка.Ссылка;
		БИК = ДанныеБанка.Код;
		КоррСчет = ДанныеБанка.КоррСчет;
		
	Иначе
		МассивБанков = ТаблицаБанков.ВыгрузитьКолонку("Ссылка");
		СписокБанков.ЗагрузитьЗначения(МассивБанков);
		
	КонецЕсли;
	
	Возврат СписокБанков;
	
КонецФункции // ПолучитьБанкПоРеквизитамСервер()

&НаСервере
// Функция получает таблицу ссылок на банки по БИКу или корреспондетскому счету.
//
// Параметры:
//	Поле - Строка - Имя поля (БИК или КоррСчет)
//	Значение - Строка - Значение БИК или Корреспондентского счета
//
// Возвращаемое значение:
//	ТаблицаЗначений - Найденые банки
//
Функция ПолучитьТаблицуБанковПоРеквизитам(Поле, Значение)
	
	ТаблицаБанков = Новый ТаблицаЗначений;
	Колонки = ТаблицаБанков.Колонки;
	Колонки.Добавить("Ссылка");
	Колонки.Добавить("Код");
	Колонки.Добавить("КоррСчет");
	
	ЭтоБИК      = Найти(Поле, "БИК")      <> 0;
	ЭтоКоррСчет = Найти(Поле, "КоррСчет") <> 0;
	
	Если Не ЭтоБИК И Не ЭтоКоррСчет Тогда
		Возврат ТаблицаБанков;
	КонецЕсли;
	
	Если (ЭтоБИК И СтрДлина(Значение) < 6) ИЛИ (ЭтоКоррСчет <> 0 И СтрДлина(Значение) < 20) Тогда
		Возврат ТаблицаБанков;
	КонецЕсли;
	
	Если ЭтоБИК Тогда
		СтруктураОтбора = Новый Структура("Код", Значение); 		
	ИначеЕсли ЭтоКоррСчет Тогда
		СтруктураОтбора = Новый Структура("КоррСчет", Значение);  		
	КонецЕсли;
	
	Выборка = Справочники.Банки.Выбрать(,, СтруктураОтбора, "Код Возр");
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаБанков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаБанков;
	
КонецФункции // ПолучитьТаблицуБанковПоРеквизитам()

&НаСервере
// Процедура выводит сообщение пользователю, если не найден банк.
//
Процедура СообщитьЧтоБанкНеНайден(Поле, Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;

	Текст = "Банк с" + 
		?(Найти(Поле, "БИК") <> 0, " БИК " + Значение, "") +
		?(Найти(Поле, "КоррСчет") <> 0, " Корр.счетом " + Значение, "") +
		" не найден в классификаторе банков.";
		
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	
КонецПроцедуры // СообщитьЧтоБанкНеНайден()

// Процедура, обработчик события "ПриИзменении".
//
&НаКлиенте
Процедура КоррСчетБанкаПриИзменении(Элемент)
	
	ПолучитьБанкПоРеквизитам(Элемент, КоррСчетБанка, Объект.Банк, БИКБанка, КоррСчетБанка);
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбораИзСписка".
//
&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	СформироватьПредставление();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НаименованиеПослеВыбораИзСписка", ЭтотОбъект), Элементы.Наименование.СписокВыбора, Элемент);

	
КонецПроцедуры

&НаКлиенте
// Процедура - Наименование после выбора из списка
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура НаименованиеПослеВыбораИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Наименование = ВыбранныйЭлемент.Значение;
	КонецЕсли;

КонецПроцедуры

// Функция, формирует наименование банковского счета.
//
&НаКлиенте 
Функция СформироватьПредставление()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = СокрЛп(Объект.НомерСчета) + ?(ЗначениеЗаполнено(Объект.Банк), ", в " + Строка(Объект.Банк), "");
	СтрокаНаименования = Лев(СтрокаНаименования, 100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	СтрокаНаименования = ?(ЗначениеЗаполнено(Объект.Банк), Строка(Объект.Банк), "") + " (" + Строка(Объект.ВалютаДенежныхСредств) + ")";
	СтрокаНаименования = Лев(СтрокаНаименования, 100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции // СформироватьАвтоНаименование()

// Процедура, обработчик события "ОбработкаВыбора"
//
&НаКлиенте
Процедура БИКБанкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;

	ЗаполнитьБИКиКоррСчет(ВыбранноеЗначение, БИКБанка, КоррСчетБанка);
	Объект.Банк = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик нажатия на кнопку "Дополнительно".
//
Процедура ПоказатьСкрытьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийФормы

// Процедура, обработчик события "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	// Заполним БИК и кор.счет банка.
	ЗаполнитьБИКиКоррСчет(Объект.Банк, БИКБанка, КоррСчетБанка);  
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти
